# Table of Contents
- 4.9 Task Pt. 1
  - Task 3
  - Task 4
  - Task 5
    - Data Type Check
    - Missing Values Check
    - Duplicate Value Check
  - Task 6
  - Task 8

# 4.9 Task Pt.1

# 3. Import your analysis libraries, as well as your new customer data set as a dataframe.

In [3]:
#importing libraries
import pandas as pd
import numpy as np
import os

In [4]:
path = r'C:\Users\nrsmi\OneDrive\Documents\CareerFoundry\06-2024 Instacart Basket Analysis\Python\06-2024 Instacart Basket Analysis'
df = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [5]:
df.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
df.shape

(206209, 10)

In [7]:
df.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

# 4. Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [10]:
# rename all columns to a similar format and user-friendly naming
df.rename(columns = {'First Name' : 'first_name'}, inplace = True)
df.rename(columns = {'Surnam' : 'last_name'}, inplace = True)
df.rename(columns = {'Gender' : 'gender'}, inplace = True)
df.rename(columns = {'STATE' : 'state'}, inplace = True)
df.rename(columns = {'Age' : 'age'}, inplace = True)
df.rename(columns = {'n_dependants' : 'number_of_dependants'}, inplace = True)
df.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [11]:
df

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...,...,...,...
206204,168073,Lisa,Case,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Jeremy,Robbins,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Doris,Richmond,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Rose,Rollins,Female,California,27,4/1/2020,1,married,99799
206208,80148,Cynthia,Noble,Female,New York,55,4/1/2020,1,married,57095

# 5. Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

### Data Type Check

In [14]:
df.dtypes

user_id                  int64
first_name              object
last_name               object
gender                  object
state                   object
age                      int64
date_joined             object
number_of_dependants     int64
marital_status          object
income                   int64
dtype: object

In [15]:
# change date_joined to date format

df['date_joined'] = pd.to_datetime(df['date_joined'])

In [16]:
df.dtypes

user_id                          int64
first_name                      object
last_name                       object
gender                          object
state                           object
age                              int64
date_joined             datetime64[ns]
number_of_dependants             int64
marital_status                  object
income                           int64
dtype: object

In [17]:
# check for mixed type columns
for col in df.columns.tolist():
  weird = (df[[col]].map(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col)

first_name

#### first_name has mixed values, so I will change them all to be the same

In [19]:
df['first_name'] = df['first_name'].astype('str')

In [20]:
df.dtypes

user_id                          int64
first_name                      object
last_name                       object
gender                          object
state                           object
age                              int64
date_joined             datetime64[ns]
number_of_dependants             int64
marital_status                  object
income                           int64
dtype: object

In [21]:
for col in df.columns.tolist():
  weird = (df[[col]].map(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col)

#### no mixed type columns now, so the adjustment was made successfully

### Missing Values Check

In [24]:
# check for missing values

df.isnull().sum()

user_id                 0
first_name              0
last_name               0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependants    0
marital_status          0
income                  0
dtype: int64

#### the only missing values are in the first_name column, so I will ignore these since it is not necessary information

### Duplicate Value Check

In [27]:
# check for duplicates
df_dups = df[df.duplicated()]
df_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, number_of_dependants, marital_status, income]
Index: []

#### no duplicate values

# 6. Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

In [30]:
# import the rest of the prepared data

df_main = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merge_derived_agg.pkl'))

In [31]:
df_main.dtypes

product_id                    int64
product_name                 object
aisle_id                      int64
department_id                 int64
prices                      float64
order_id                      int64
user_id                       int64
order_number                  int64
orders_day_of_week            int64
order_hour_of_day             int64
days_since_prior_order      float64
add_to_cart_order             int64
reordered                     int64
_merge                     category
busiest_day                  object
price_range_loc              object
busiest_days                 object
busiest_period_of_day        object
max_order                     int64
loyalty_flag                 object
average_spend               float64
spender_flag                 object
order_frequency             float64
Customer_frequency_flag      object
dtype: object

### the key column between both dataframes is the 'user_id' column

In [33]:
# drop the merge column from the main dataframe since it is not necessary anymore

df_2 = df_main.drop(columns=['_merge'])

In [34]:
df_2.head(2)

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,busiest_day,price_range_loc,busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_spend,spender_flag,order_frequency,Customer_frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Regularly busy,Mid-range product,Regularly busy,Most orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Regularly busy,Mid-range product,Regularly busy,Average orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer

In [35]:
# merge dataframes on 'user_id"
df_merged = df_2.merge(df, on = 'user_id', indicator = True)

In [66]:
df_merged.shape

(32404859, 33)

## 8. Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [38]:
# df_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_customer_agg.pkl'))